priv/static/doc/html/elements/menu.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Menu Element</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-02-06 22:40:48 GMT"/>
<meta name="author" content="Roman Shestakov (@rshestakov)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Menu Element</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Menu Element - #menu {} </a>
<ul>
<li><a href="#sec-1.1">1.1 Usage </a></li>
<li><a href="#sec-1.2">1.2 Attributes </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Menu Element - #menu {} </h2>
<div class="outline-text-2" id="text-1">


<p>
The implementation of jQuery menu element.
</p>

</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Usage </h3>
<div class="outline-text-3" id="text-1.1">





<pre class="example">#menu{
    id = menu,
    options = [ %%{disabled, true},
        {icons, {{submenu, &lt;&lt;"ui-icon-circle-triangle-e"&gt;&gt;}}},
        {position, {{my, &lt;&lt;"left top"&gt;&gt;}, {at, &lt;&lt;"right top"&gt;&gt;}}}
    ],
    style = "width:150px;",
    body = [
        #item{title = "USA", body = [#item{title = "New York City"}, #item{title = "Boston"}]},
        #item{title = "UK"},
        #item{title = "Russia"}
    ],
    %% add actions which bind native menu events
    actions = [
        #menu_event_on{trigger = menu, type = ?EVENT_MENU_BLUR, postback = {Tag, {menu, ?EVENT_MENU_BLUR}}},
        #menu_event_on{trigger = menu, type = ?EVENT_MENU_CREATE, postback = {Tag, {menu, ?EVENT_MENU_CREATE}}},
        #menu_event_on{trigger = menu, type = ?EVENT_MENU_FOCUS, postback = {Tag, {menu, ?EVENT_MENU_FOCUS}}},
        #menu_event_on{trigger = menu, type = ?EVENT_MENU_FOCUS, postback = {Tag, {menu, ?EVENT_MENU_SELECT}}}
    ]
}

</pre>




</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> Attributes </h3>
<div class="outline-text-3" id="text-1.2">


<dl>
<dt>body - (<i>list of #item{} elements</i>)</dt><dd>
Set of the items in the
#menu, could be recursive.

</dd>
<dt>options - (<i>list of tuples</i>)</dt><dd>
Options which are set during tabs initialization.
</dd>
</dl>
</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Roman Shestakov (@rshestakov)
<a href="mailto:">&lt;&gt;</a>
</p>
<p class="date"> Date: 2013-02-06 22:40:48 GMT</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
